---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SketchFailures
source: html/ce55b9a0-e569-f16f-8d5c-daaa442dd2eb.htm
---
# BuiltInFailures.SketchFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.